Revit 2027 API
BuiltInFailures.WallFailures.CannotChangeTypeOfOldCurtainPanel Property
 Cannot change the type of curtain panels in walls created with early versions of Revit. To change the panels of this curtain wall, wall must be recreated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeTypeOfOldCurtainPanel { get; }
Public Shared ReadOnly Property CannotChangeTypeOfOldCurtainPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeTypeOfOldCurtainPanel {
	FailureDefinitionId^ get ();
}
static member CannotChangeTypeOfOldCurtainPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace